nursingengineeringlab/nrf52/nrf52832-ads1292-fw-main/app/project/ble_peripheral/ble_app_template/main.c
/**
 * @file       main.c
 * @version    1.0.0
 * @date       2022-09-25
 * @author     Abu Bony Amin, Ebenezer Asabre, Akshat Sahay 
 * @brief      EMG Signal Collection and Analysis 
 * @note       None
 * @example    None
 */

/* Includes ----------------------------------------------------------- */
#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_delay.h"

#include "sys_bm.h"
#include "ble_bas.h"
#include "ble_dis.h"
#include "ble_acs.h"
#include "ble_mgs.h"
#include "ble_gys.h"
#include "bsp_hw.h"
#include "bsp_imu.h"
#include "bsp_afe.h"
#include "bsp_nand_flash.h"
#include "nrf52832_peripherals.h"

#if defined(UART_PRESENT)
#include "nrf_uart.h"
#endif
#if defined(UARTE_PRESENT)
#include "nrf_uarte.h"
#endif

/* Private defines ---------------------------------------------------- */
#define APP_BLE_CONN_CFG_TAG            1                                          /**< A tag identifying the SoftDevice BLE configuration. */

#define SENSORS_MEAS_INTERVAL           APP_TIMER_TICKS(2000)                      /**< Sensors measurement interval (ticks). */
#define BATT_LEVEL_MEAS_INTERVAL        APP_TIMER_TICKS(20000)                     /**< Battery level measurement interval (ticks). */

#define DEVICE_NAME                     "imu-lcd"                                  /**< Name of device. Will be included in the advertising data. */

#define MANUFACTURER_NAME               "miBEAT"                                   /**< Manufacturer. Will be passed to Device Information Service. */

#define ACS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */

#define APP_ADV_DURATION                18000                                       /**< The advertising duration (180 seconds) in units of 10 milliseconds. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define MA_FILTER_SIZE                  50                                          /**< Size of MA filter for filtering ECG/EMG data. */ 
#define EMG_SIGNAL_SIZE                 64                                          /**< Size of processed ECG/EMG signal. */ 
#define ENVELOPE_SIZE                   100                                         /**< Size of EMG envelope. */
#define THRESHOLD                       0                                           /**< Threshold for myopulse percent 

/* Private macros ----------------------------------------------------- */                                                            /**< BLE HRNS service instance. */
BLE_ACS_DEF(m_acs);                                                                 /**< BLE ACS service instance. */
BLE_MGS_DEF(m_mgs);                                                                 /**< BLE MGS service instance. */
BLE_GYS_DEF(m_gys);                                                                 /**< BLE GYS service instance. */
BLE_BAS_DEF(m_bas);                                                                 /**< Structure used to identify the battery service. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */
APP_TIMER_DEF(m_sensors_timer_id);                                                  /**< Sensor measurement timer. */
APP_TIMER_DEF(m_battery_timer_id);                                                  /**< Battery timer. */

/* Private variables -------------------------------------------------- */
static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
  {BLE_UUID_BATTERY_SERVICE,            BLE_UUID_TYPE_BLE},
  {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
};

// uint32_t app_time;
// int16_t ecg_value;

uint32_t app_time;                                                                   /**< Elapsed time in the app. */                                                                                                                                           
int16_t emg_value_raw;                                                               /**< Current raw ECG/EMG sample from AFE. */  
int16_t emg_mean_absolute_value;                                                     /**< Mean absolute value for the collected ECG/EMG samples. */                                                         
int16_t emg_integrated;                                                              /**< Integrated ECG/EMG value for the collected samples. */ 
int16_t emg_ssi;                                                                     /**< Integrated square ECG/EMG value for collected samples. */
int16_t emg_variance;                                                                /**< Variance of ECG/EMG signal. */  
int16_t emg_myopulse_percent;                                                        /**< Myopulse percentage rate of ECG/EMG signal. */

int16_t emg_array_raw[MA_FILTER_SIZE];                                               /**< Raw ECG/EMG signals used for MA filter. */ 
uint8_t emg_array_raw_index;                                                         /**< Index for ecg_array_raw. */ 
int16_t emg_array_out[EMG_SIGNAL_SIZE];                                              /**< Processed output ECG/EMG signals. */ 
uint8_t emg_array_out_index;                                                         /**< Index for ecg_array_out. */
int16_t emg_envelope[ENVELOPE_SIZE];                                                 /**< EMG envelope. */
uint8_t emg_envelope_index;                                                          /**< Index for EMG envelope. */

/* Private function prototypes ---------------------------------------- */
static void timers_init(void);
static void gap_params_init(void);
static void nrf_qwr_error_handler(uint32_t nrf_error);
static void services_init(void);
static void on_conn_params_evt(ble_conn_params_evt_t *p_evt);
static void conn_params_init(void);
static void sleep_mode_enter(void);
static void on_adv_evt(ble_adv_evt_t ble_adv_evt);
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context);
static void ble_stack_init(void);
static void gatt_init(void);
static void advertising_init(void);
static void log_init(void);
static void power_management_init(void);
static void idle_state_handle(void);
static void advertising_start(void);

static void battery_level_meas_timeout_handler(void * p_context);
static void sensors_meas_timeout_handler(void * p_context);

static void battery_level_update(void);
static void sensors_value_update(void);

static void acs_service_init(void);
static void mgs_service_init(void);
static void bas_service_init(void);
static void dis_service_init(void);

static void application_timers_start(void);

/* Function definitions ----------------------------------------------- */
/**
 * @brief Application main function.
 */
int main(void)
{
  // Initialize.

  // initialize arrays 
  emg_array_raw_index = 0; 
  emg_array_out_index = 0; 

  double MA_sum = 0; 

  log_init();
  timers_init();
  power_management_init();
  ble_stack_init();
  gap_params_init();
  gatt_init();
  services_init();
  advertising_init();
  conn_params_init();

  bsp_hw_init();
  bsp_nand_flash_init();
  bsp_imu_init();
  bsp_afe_init();

  // Start execution.
  application_timers_start();
  advertising_start();

  for (;;)
  {
    NRF_LOG_PROCESS();

    if (bsp_afe_get_ecg(&emg_value_raw) == BS_OK) {
      // works for MA filter, trying iEMG

      // print raw EMG data
      NRF_LOG_INFO("In EMG: %d\n", emg_value_raw);

      // add raw sample to ecg_array_raw, increment index
      emg_array_raw[emg_array_raw_index] = emg_value_raw; 
      if(emg_array_raw_index < MA_FILTER_SIZE - 1) emg_array_raw_index++; 
      else emg_array_raw_index = 0; 

